{
  "backend/main.mo": "Main Motoko actor defining all backend data types (UserProfile, Listing, Community, Event, Message) and state maps for a student platform called UniShare, with mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: fixing footer visibility on mobile in Layout.tsx and updating the logo in AboutPage.tsx to match the Navbar logo lockup.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details, serving as a reference for the frontend codebase.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for the light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app with the page title set to 'UniShare' and a root div where the app mounts.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (home, marketplace, communities, events, profile, about) wrapped in ThemeProvider and QueryClientProvider.",
  "frontend/src/components/BottomTabBar.tsx": "Mobile-only fixed bottom navigation bar with four tabs (Home, Market, Groups, Events) that highlights the active route.",
  "frontend/src/components/communities/CommunityCard.tsx": "Card component that displays a community's cover image, category badge, privacy status, name, description, member count, and city as a navigable link.",
  "frontend/src/components/communities/CommunityFilters.tsx": "Filter bar for communities providing a category dropdown and a city text input to narrow community listings.",
  "frontend/src/components/communities/CreateCommunityModal.tsx": "Modal form for creating a new community with fields for name, description, category, college, city, visibility, and an optional cover image upload with progress tracking.",
  "frontend/src/components/communities/MemberList.tsx": "Card component that renders a list of community members by fetching each member's profile by principal and displaying their avatar, name, and college.",
  "frontend/src/components/communities/PendingRequestsPanel.tsx": "Card panel showing pending community join requests, allowing admins to approve individual members with a button that calls the approveMember mutation.",
  "frontend/src/components/events/EventCard.tsx": "Renders a card UI for a single event with category badge, date, venue, college, and organizer info, linking to the event detail page. Highlights platform-organized events with a special badge and ring style.",
  "frontend/src/components/events/EventFilters.tsx": "Provides a filter bar for events with a category dropdown and city text input, calling an onChange callback with the updated EventFilter object.",
  "frontend/src/components/events/PostEventModal.tsx": "Modal dialog form for creating a new event, collecting title, description, category, venue, date, and registration link, then submitting via the useCreateEvent mutation.",
  "frontend/src/components/Layout.tsx": "App shell component rendering the Navbar, main content area, BottomTabBar, and a footer visible on all screen sizes with the UniShare icon+wordmark brand lockup and social links.",
  "frontend/src/components/marketplace/ListingCard.tsx": "Renders a marketplace listing card with an optional image, price, category badge, listing type, city, and seller name, linking to the listing detail page.",
  "frontend/src/components/marketplace/MarketplaceFilters.tsx": "Sidebar filter panel for marketplace listings supporting category, transaction type, area scope, and city filters via dropdowns and a text input.",
  "frontend/src/components/marketplace/PostListingModal.tsx": "Modal form for creating a new marketplace listing with fields for title, description, category, type, price, location, and an optional image upload with progress tracking.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, desktop nav links, and an auth section that handles Internet Identity login/logout via a dropdown menu and mobile hamburger menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to set up their profile, collecting name, college, city, course, year, interests, and social links, with auto-detected city via geolocation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profiles, listings, communities, events, and messaging, wrapping actor calls with useQuery and useMutation.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for a teal/amber academic color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static informational page describing UniShare's features (Marketplace, Communities, Events, Profile, Location) with step-by-step guides and an FAQ accordion.",
  "frontend/src/pages/CommunitiesPage.tsx": "Page component for browsing and managing communities, supporting search, category/city filtering, tabbed all/my-communities views, and a modal for creating new communities.",
  "frontend/src/pages/CommunityDetailPage.tsx": "Displays detailed information about a single community including members, pending requests, and join/request actions. Handles creator/member/pending state checks and shows appropriate UI based on the current user's relationship to the community.",
  "frontend/src/pages/EventDetailPage.tsx": "Renders a detailed view of a single event with image, metadata, and registration functionality. Distinguishes between platform-official and user-created events and handles registration state for the logged-in user.",
  "frontend/src/pages/EventsPage.tsx": "Lists all events with search, filter, and category badge controls, separating platform events from user-posted events. Authenticated users can open a modal to post new events.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero banner, live stats bar, and preview sections for recent marketplace listings, communities, and events. Links out to the main section pages.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows full details of a marketplace listing including image, price, category, and status badges. Listing owners can update the listing status (e.g., mark as sold) directly from this page.",
  "frontend/src/pages/MarketplacePage.tsx": "React page for browsing and posting marketplace listings, featuring search, active filter badges, a filter panel, and a post listing modal gated behind authentication.",
  "frontend/src/pages/ProfilePage.tsx": "React page displaying the authenticated user's profile, including avatar upload, editable profile details, and tabs for their listings and joined communities; shows a login prompt when unauthenticated.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens (teal, amber, semantic UI colors), border radii, box shadows, and fade/accordion animations.",
  "project_state.json": "Project state manifest (version 13) describing the UniShare university app's features, architecture, known UI bugs, and existing implemented feature list for build planning."
}