{
  "kind": "build_request",
  "title": "Fix footer visibility on mobile and update logo in About page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Fix the footer in Layout.tsx so it is visible on mobile devices. The footer must render below the main content area (including below the About section content when on the /about route) on all screen sizes. Remove any CSS or Tailwind classes that hide the footer on mobile (e.g. 'hidden' or 'md:flex' without a mobile fallback). Ensure the footer appears at the bottom of the page on both desktop and mobile viewports.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the footer section is showing in pc but not in mobile , so make it visible at bellow in about section"
        ]
      },
      "acceptanceCriteria": [
        "Footer is visible on mobile screen sizes (< 768px) on all pages including /about",
        "Footer renders below all page content on mobile without being clipped or hidden",
        "Footer continues to display correctly on desktop/PC as before",
        "No Tailwind responsive prefix (e.g. 'hidden', 'sm:hidden') causes the footer to disappear on small screens"
      ]
    },
    {
      "id": "REQ-37",
      "text": "Update the logo displayed in the About page (AboutPage.tsx) to match the current UniShare logo used in the Navbar — a small square rounded icon (group-of-people/campus illustration) alongside the bold 'UniShare' wordmark. Replace any outdated or placeholder logo rendering in AboutPage.tsx with the same logo lockup (icon + wordmark) that is used in Navbar.tsx, using the same asset file (e.g. /assets/generated/unishare-logo.png or equivalent) and consistent styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "in the about section update the logo also"
        ]
      },
      "acceptanceCriteria": [
        "The About page displays the current UniShare logo (icon + wordmark) matching the Navbar logo",
        "The logo in the About page uses the same image asset as the Navbar logo",
        "No outdated or mismatched logo is shown anywhere on the About page",
        "The logo renders correctly on both mobile and desktop viewports"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths",
    "Do not alter the footer's content (developer name, LinkedIn/Instagram links) — only fix its visibility on mobile"
  ],
  "nonGoals": [
    "Redesigning the footer layout or adding new footer content",
    "Changes to any page other than Layout.tsx and AboutPage.tsx",
    "Backend changes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}